Working through [Curious Moon](https://bigmachine.io/products/a-curious-moon/) by Rob Conery to improve my Postgres skills.

#+TITLE: Notes on A Curious Moon
#+AUTHOR: Meks McClure
#+EMAIL: mmcclure0100@gmail.com
#+PROPERTY: header-args:sql :engine postgresql
#+PROPERTY: header-args:sql+ :dbhost $HOME/Projects/curious-moon/.tmp/db
#+PROPERTY: header-args:sql+ :database enceladus

** A Simple SQL Script

We'll make a script, ~build.sql~, which can be pushed into ~psql~ via one of two methods:

- =psql enceladus < build.sql=
- =psql enceladus -f build.sql=

Order of operations is important; everything should be dropped at the beginning of the script, if it exists, and created at the end.

Note that the columns created map to the columns in the CSV and are created as ~text~ (we'll worry about typing later).

#+begin_src sql
  DROP TABLE IF EXISTS master_plan;

  CREATE TABLE master_plan (
      start_time_utc text,
      duration text,
      date text,
      team text,
      spass_type text,
      target text,
      request_name text,
      library_definition text,
      title text,
      description text
  );

  COPY master_plan
  FROM
      '/Users/nscheurich/Projects/curious-moon/data/master_plan.csv' WITH DELIMITER ',' header csv;
#+end_src

#+RESULTS:
| DROP TABLE   |
|--------------|
| CREATE TABLE |
| COPY 61873   |

** Using a Schema

Postgres has a hierarchy:

- *The cluster.* Set of servers (usually just one) that execute instructions.
- *The database.* Self-evident.
- *One or more schemas.* Sort of like namespaces. The default is ~public~.
- *Tables, views, functions*, and other /relations/.

#+NAME: build.sql
#+begin_src sql :tangle scripts/build-123.sql
  CREATE SCHEMA IF NOT EXISTS import;

  DROP TABLE IF EXISTS import.master_plan;

  CREATE TABLE import.master_plan (
      start_time_utc text,
      duration text,
      date text,
      team text,
      spass_type text,
      target text,
      request_name text,
      library_definition text,
      title text,
      description text
  );

  COPY master_plan
  FROM
      '/Users/nscheurich/Projects/curious-moon/data/master_plan.csv' WITH DELIMITER ',' header csv;
#+end_src

#+RESULTS: build.sql
| CREATE SCHEMA |
|---------------|
| DROP TABLE    |
| CREATE TABLE  |
| COPY 61873    |

